# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму
# этих чисел к полученной ранее сумме и после этого завершить программу.

def summ():
    summ = 0
    while True:
        s = input('Введите числа через пробел: ')
        digit_list = s.split()
        if s == '#':
            break
        elif "#" in digit_list:
            for elem in digit_list:
                while elem != "#":
                    summ += int(elem)
                    break
            break
        else:
            for elem in digit_list:
                summ += int(elem)
            print(summ)

    print(f'Result: {summ}')


summ()
