# Для списка реализовать обмен значений соседних элементов, т.е. Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте. Для заполнения списка элементов необходимо использовать функцию input().

string = input("Введите элементы списка через пробел: ")
work_list = string.split(' ')
lenght = len(work_list)
i = 0
while i < (lenght - lenght % 2):
    work_list[i], work_list[i+1] = work_list[i+1], work_list[i]
    i = i + 2
print(work_list)
