# Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает
# фирма. Например, прибыль — выручка больше издержек, или убыток — издержки больше выручки.
# Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки.
# Это отношение прибыли к выручке. Далее запросите численность сотрудников фирмы и определите прибыль фирмы
# в расчёте на одного сотрудника.

proceeds = float(input("Введите выручку организации: "))
costs = float(input("Введите сумму расходов организации: "))
if proceeds > costs:
    print("За выбранный период организация отработала с прибылью")
    rent = costs / proceeds
    amount = int(input("введите количество сотрудников организации: "))
    result = (proceeds - costs) / amount
    print("Прибыль на одного сотрудника составила", result, "рублей")
else:
    print("За выбранный период организация отработала в убыток")

