"""Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах*ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами."""


# import argparse - импортируем модуль, отвечающий за распознавание и управление параметрами, передаваемыми в скрипт извне
import argparse

# Создаем экземпляр парсера-распознавателя переданных аргументов
parser = argparse.ArgumentParser(description='Программа расчитывает заработную плату сотрудника')
# Сообщаем ранее созданному парсеру перечень аргументов для использования.
parser.add_argument('work_hours', type=int, help='Выработка в часах')
parser.add_argument('bid', type=int, help='Ставка за один час')
parser.add_argument('KPI', type=int, help='Премия')
# Создаем экземпляр аргументов. Ну т.е. вот тут парсер понимает, что ему что-то передали и понимает, что чему присвоить.
args = parser.parse_args()

# Создаем функцию с перечнем параметров, которые должны быть переданы на вход
def salary(work_hours, bid, KPI):
    print(args.work_hours * args.bid + args.KPI)

# Вызываем функцию, указав, что она должна принимать аргументы из парсера, созданного ранее
result = salary(args.work_hours, args.bid, args.KPI)

# Чтобы проверить задачу:
# 1) Скопируйте код в новый *.py файл
# 2) Откройте Power Shell (windows) или terminal (*nix подобные ОС)
# 3) Перейдите в каталог с созданным на шаге 1) *.py файлом
#   - cd [диск]:\каталог-с-файлом (windows, пример cd D:/Python_project/python_edu/lesson4/task4_1.py)
#   - cd /путь-к-файлу/ (*nix подобные системы, пример /Users/username/Python_project/python_edu/lesson4/task4_1.py)
# 4) Выполните команду: "python task4_1.py 40 1000 20000", где 40 - это args.work_hours, 1000 - args.bid, 20000 - args.KPI
# Ожидаемый результат: 60 000