"""Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123]."""

import random

old_list = [random.randint(0, 999) for _ in range(15)]
new_list = []
for i in range(len(old_list) - 1):
    if old_list[i] > old_list[i + 1]:
        new_list.append(old_list[i])

print(f'Исходный список: {old_list}')
print(f'Результат: {new_list}')
