"""2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса.
Атрибуты сделать защищенными. Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
Использовать формулу: длина*ширина*масса асфальта для покрытия одного кв метра дороги асфальтом,
толщиной в 1 см*число см толщины полотна.
Проверить работу метода.
Например: 20м*5000м*25кг*5см = 12500 т"""


class Road:

    def __init__(self, length, width):
        self.length = length
        self.width = width
        self._weight = 25
        self._height = 5

    def asphalt_mass(self):
        asphalt_mass = self.length * self.width * self._weight * self._height / 1000
        print(f'Для покрытия всего дорожного полотна неободимо {round(asphalt_mass)} тонн асфальта')


r = Road(20, 5000)
r.asphalt_mass()
