"""Создать программно файл в текстовом формате, записать в него построчно
данные, вводимые пользователем. Об окончании ввода данных свидетельствует пустая строка."""

# При проверке не удаляйте полученный файл - он используется в задаче № 2. Спасибо!


def text_recorder():
    with open('file_for_task1.txt','w', encoding="1251") as f:
        while (text := input("Введите текст (Enter для завершения ввода): ")) != "":
            print(text, file=f)


text_recorder()
